{
  "CivExamSim": [
    {
      "id": 1,
      "fact": "A Delaware company with no offices or employees in Texas sells 5% of its products online to Texas residents.",
      "options": ["General Jurisdiction", "Specific Jurisdiction", "No Jurisdiction", "Consent"],
      "answer": 2,
      "rule": "Daimler AG v. Bauman — sporadic sales insufficient for general jurisdiction; not 'essentially at home.'"
    },
    {
      "id": 2,
      "fact": "A Florida driver crashes into a Georgia resident while driving through Georgia.",
      "options": ["General Jurisdiction", "Specific Jurisdiction", "No Jurisdiction", "Forum Non Conveniens"],
      "answer": 1,
      "rule": "International Shoe — claim arises out of defendant’s in-state conduct; specific jurisdiction proper."
    },
    {
      "id": 3,
      "fact": "An Ohio tire explodes in France, injuring a French driver; the tire was originally sold in Ohio.",
      "options": ["Specific Jurisdiction", "General Jurisdiction", "No Jurisdiction", "Consent"],
      "answer": 2,
      "rule": "Goodyear v. Brown — no general jurisdiction over foreign subsidiaries; claim unrelated to forum contacts."
    },
    {
      "id": 4,
      "fact": "A Pennsylvania plaintiff sues a Virginia manufacturer for injuries from a product purchased in Virginia but used in Pennsylvania.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "Consent", "General Jurisdiction"],
      "answer": 1,
      "rule": "Bristol-Myers Squibb — claim must arise out of or relate to defendant’s forum contacts."
    },
    {
      "id": 5,
      "fact": "A New York newspaper posts an online article allegedly defaming a Texas resident.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "General Jurisdiction", "Forum Non Conveniens"],
      "answer": 1,
      "rule": "Calder v. Jones — jurisdiction proper only if defendant’s conduct expressly aimed at forum; passive site insufficient."
    },
    {
      "id": 6,
      "fact": "A California car dealer advertises online; a Colorado buyer travels to California, buys a car, and crashes in Colorado.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "General Jurisdiction", "Venue"],
      "answer": 1,
      "rule": "World-Wide Volkswagen — unilateral action by consumer cannot create forum contacts."
    },
    {
      "id": 7,
      "fact": "A Nevada casino mails flyers and offers free rooms to California residents who later sue in California for injuries at the casino.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "General Jurisdiction", "Consent"],
      "answer": 1,
      "rule": "Kulko / Walden v. Fiore — contact must arise from defendant’s purposeful forum conduct, not plaintiff’s connections."
    },
    {
      "id": 8,
      "fact": "A corporate officer personally guarantees a loan in Texas and later disputes the contract.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "General Jurisdiction", "Consent"],
      "answer": 0,
      "rule": "Burger King v. Rudzewicz — purposeful availment through deliberate contract negotiation with forum resident."
    },
    {
      "id": 9,
      "fact": "A Minnesota company registers to do business in Pennsylvania and appoints a local agent for service.",
      "options": ["Consent", "General Jurisdiction", "Specific Jurisdiction", "No Jurisdiction"],
      "answer": 0,
      "rule": "Mallory v. Norfolk Southern — registration statute can constitute consent to general jurisdiction."
    },
    {
      "id": 10,
      "fact": "A New Jersey car dealer sells through a regional distributor who sells into Louisiana; a Louisiana buyer is injured.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "General Jurisdiction", "Forum Non Conveniens"],
      "answer": 0,
      "rule": "Stream of Commerce — jurisdiction proper if defendant purposefully directed products into forum market."
    },
    {
      "id": 11,
      "fact": "A Georgia corporation has continuous offices and staff in Alabama but is sued there for a Kentucky accident.",
      "options": ["General Jurisdiction", "Specific Jurisdiction", "No Jurisdiction", "Consent"],
      "answer": 0,
      "rule": "Perkins v. Benguet Mining — continuous and systematic contacts justify general jurisdiction."
    },
    {
      "id": 12,
      "fact": "A Texas court hears a divorce case though neither spouse lives in Texas.",
      "options": ["Subject-Matter Jurisdiction", "Personal Jurisdiction", "No Jurisdiction", "Venue"],
      "answer": 0,
      "rule": "Courts must have authority over type of case; residency required for domestic relations."
    },
    {
      "id": 13,
      "fact": "A Mississippi plaintiff sues a Japanese manufacturer in Mississippi for injuries caused by a product sold there by a regional distributor.",
      "options": ["Specific Jurisdiction", "No Jurisdiction", "General Jurisdiction", "Consent"],
      "answer": 0,
      "rule": "Asahi / Nicastro — split views; must show targeting of forum, not mere foreseeability."
    },
    {
      "id": 14,
      "fact": "A Kansas company sues a Colorado buyer in Kansas federal court for breach of contract.",
      "options": ["Diversity Jurisdiction", "Federal Question", "Supplemental Jurisdiction", "No Jurisdiction"],
      "answer": 0,
      "rule": "28 U.S.C. §1332 — diversity of citizenship and >$75,000 in controversy confer subject-matter jurisdiction."
    },
    {
      "id": 15,
      "fact": "A plaintiff files a federal civil rights claim under 42 U.S.C. §1983 against a state officer.",
      "options": ["Federal Question", "Diversity", "Supplemental", "No Jurisdiction"],
      "answer": 0,
      "rule": "28 U.S.C. §1331 — cases arising under federal law create federal question jurisdiction."
    },
    {
      "id": 16,
      "fact": "A federal court hears a state-law negligence claim appended to a federal employment discrimination case.",
      "options": ["Supplemental Jurisdiction", "Diversity", "No Jurisdiction", "General Jurisdiction"],
      "answer": 0,
      "rule": "§1367 — supplemental jurisdiction when claims share common nucleus of operative fact."
    },
    {
      "id": 17,
      "fact": "A plaintiff sues in federal court over a $60,000 contract dispute between citizens of different states.",
      "options": ["Diversity Jurisdiction", "No Jurisdiction", "Supplemental Jurisdiction", "Venue"],
      "answer": 1,
      "rule": "§1332 requires >$75,000; amount-in-controversy not met."
    },
    {
      "id": 18,
      "fact": "A plaintiff sues an in-state defendant in federal court for negligence under state law only.",
      "options": ["No Jurisdiction", "Diversity Jurisdiction", "Supplemental Jurisdiction", "Federal Question"],
      "answer": 0,
      "rule": "No diversity (same state) and no federal question; case must be filed in state court."
    },
    {
      "id": 19,
      "fact": "A corporation incorporated in Delaware but headquartered in California is sued in both states.",
      "options": ["Both States Have General Jurisdiction", "Only Delaware", "Only California", "Neither"],
      "answer": 0,
      "rule": "Daimler — 'at home' in both state of incorporation and principal place of business."
    },
    {
      "id": 20,
      "fact": "A federal court transfers a case for convenience to another district where it could have been brought.",
      "options": ["§1404 Transfer", "Forum Non Conveniens", "Venue", "Abstention"],
      "answer": 0,
      "rule": "28 U.S.C. §1404(a) — transfer for convenience when both venue and jurisdiction proper."
    }
  ]
}
